<?php
require_once '../global_mysql_connect.php';
require_once '../function/function.php';
$id = trim($_POST['material_specification_id']);
//材料牌号
$array_material_specification = array("45#(国产)","S50C(国产)","P20(国产)","P20(进口)","718/718H(国产)","718/718H(进口)","738/738H(国产)","2738(国产)","738/738H(进口)","2311(国产)","2311(进口)","2312(国产)","2312(进口)","NAK80(国产)","NAK80(进口)","2711(进口)","Cr12(国产)","H13(国产)","H13(进口)","S136(国产)","S136(进口)","8407(国产)","8407(进口)","8402(国产)","8402(进口)","2344(国产)","2344(进口)","2344SER(国产)","2344SER(进口)","2343(国产)","2343(进口)","2343SER(国产)","2343SER(进口)","DAC-S(进口)","CENA1(进口)","PX4(进口)","PX5(进口)","S-STAR(进口)","2083(国产)","2083(进口)","Cu","S45C","SUS420J2",'1.1730','1.2343','1.2343SER','1.2344','1.2344SER','1.2312','SKD61','1.2311','1.2738','1.2738HH','XPM','XPMESR','GEST80','GEST80ESR','1.2083','1.2083ESR','S136H','420');
//材料硬度
$array_material_hard = array('18-28','28-32','38-42','48-52','28~32','37~41','32~36','31~36','15~20','33-37');
//对应关系
$array_specification_hard = array('P20(国产)'=>'28~32','P20(进口)'=>'28~32','NAK80(国产)'=>'37~41','NAK80(进口)'=>'37~41','738/738H(国产)'=>'32~36','738/738H(进口)'=>'32~36','718/718H(国产)'=>'31~36','718/718H(进口)'=>'31~36','2344(国产)'=>'48~52','2344(进口)'=>'48~52','SKD61'=>'48~52','2343(国产)'=>'48~52','2343(进口)'=>'48~52','S50C(国产)'=>'15~20','1.1730'=>'15~20','1.2311'=>'28-32','1.2312'=>'28-32','1.2738'=>'28-32','1.2738HH'=>'33-37','XPM'=>'38-42','XPMESR'=>'38-42','GEST80'=>'38-42','GEST80ESR'=>'38-42','1.2083'=>'48~52','1.2083ESR'=>'48~52','1.2344'=>'48~52','1.2344ESR'=>'48~52','1.2343'=>'48~52','1.2343ESR'=>'48~52','S136(国产)'=>'48~52','S136(进口)'=>'48~52','S136H'=>'38-42','8407(国产)'=>'48~52','8407(进口)'=>'48~52','H13'=>'48~52','420'=>'48~52','cu'=>'38-42');
$specification_val = $array_material_specification[$id];
foreach($array_specification_hard as $k=>$v){
	if($specification_val == $k){
		foreach($array_material_hard as $ks=>$vs){
			if($vs == $v){
				echo $ks;
			}
		}
	}
}

?>